update zshrc to use sheldon
